---
kind: other
id: Methods.T:Autodesk.Revit.DB.BoundaryValidation
source: html/38bf7d40-9cba-a45e-efd1-4a9878e901ee.htm
---
# BoundaryValidation Methods

Indicates if the given curve loops compose a valid boundary on the sketch plane.